TRUNCATE TABLE dbo.继教能级;
INSERT dbo.继教能级
        ( 名称, 备注 )
VALUES  ( N'N0',N''),( N'N1',N''),( N'N2',N''),( N'N3',N''),( N'N4',N'')

GO

TRUNCATE TABLE dbo.继教权限;

--首页是谁都有的
INSERT dbo.继教权限
        ( 编号, 上级编号, 深度, 排序值, 名称, 组件名, 是否菜单, 图标, 备注 )
VALUES  ( 1,0,1,0,N'慕课',N'', 1,N'',N'' ),
( 101,1,2,1,N'慕课活动',N'', 1,N'',N'' ),
( 102,1,2,2,N'素材库',N'', 1,N'',N'' ),
( 103,1,2,3,N'题库',N'', 1,N'',N'' ),

( 2,0,1,0,N'考试',N'', 1,N'',N'' ),
( 201,2,2,1,N'理论考试',N'', 1,N'',N'' ),
( 202,2,2,2,N'试卷',N'', 1,N'',N'' ),
( 203,2,2,3,N'题库',N'', 1,N'',N'' ),
( 204,2,2,4,N'操作考试',N'', 1,N'',N'' ),
( 205,2,2,5,N'评分表',N'', 1,N'',N'' ),

( 3,0,1,0,N'签到',N'', 1,N'',N'' ),

( 4,0,1,0,N'组织机构',N'', 1,N'',N'' ),
( 401,4,2,1,N'部门人员信息',N'', 1,N'',N'' ),

( 5,0,1,0,N'系统设置',N'', 1,N'',N'' ),
( 501,5,2,1,N'登录日志',N'', 1,N'',N'' ),
( 502,5,2,2,N'权限管理',N'', 1,N'',N'' ),
	( 50201,502,3,1,N'角色及权限',N'', 1,N'',N'' ),
( 503,5,2,3,N'设置',N'', 1,N'',N'' ),
( 504,5,2,4,N'基础信息',N'', 1,N'',N'' ),
	( 50401,505,3,1,N'学历',N'', 1,N'',N'' ),
	( 50402,505,3,2,N'职称',N'', 1,N'',N'' ),
	( 50403,505,3,3,N'学科',N'', 1,N'',N'' ),
	( 50404,505,3,4,N'民族',N'', 1,N'',N'' ),
	( 50405,505,3,5,N'能级',N'', 1,N'',N'' );

GO

--微信端,"首页","我的活动","个人中心"都是固定死的
TRUNCATE TABLE dbo.继教微信权限;

INSERT dbo.继教微信权限
        ( 编号, 上级编号, 深度, 排序值, 名称, 组件名, 是否菜单, 图标, 备注 )
VALUES  ( 1,0,1,1,N'操作评分',N'',1,N'',N''),( 2,0,1,2,N'管理员',N'',1,N'',N'')

GO
